Tekla Open API Reference for Tekla Structures 2025
Line Constructor
Overload List
Name | Description
Line(ViewBase, Point, Point)
 Creates a new line instance with two points and no bulge (straight line) using standard attributes.
Line(ViewBase, Point, Point, Double)
 Creates a new line instance with two points and a bulge using standard attributes.
Line(ViewBase, Point, Point, Line.LineAttributes)
 Creates a new line instance with two points and no bulge (straight line) using the given attributes.
Line(ViewBase, Point, Point, Double, Line.LineAttributes)
 Creates a new line instance with two points and a bulge using the given attributes.
Top
See Also
Reference
Line Class
Tekla.Structures.Drawing Namespace